hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_exti.h
#define	EXTI_RPR1_RPIF21				(0x1u<<21)
#define	EXTI_RPR1_RPIF20				(0x1u<<20)
#define	EXTI_RPR1_RPIF15				(0x1u<<15)
#define	EXTI_RPR1_RPIF14				(0x1u<<14)
#define	EXTI_RPR1_RPIF13				(0x1u<<13)
#define	EXTI_RPR1_RPIF12				(0x1u<<12)
#define	EXTI_RPR1_RPIF11				(0x1u<<11)
#define	EXTI_RPR1_RPIF10				(0x1u<<10)
#define	EXTI_RPR1_RPIF9					(0x1u<<9)
#define	EXTI_RPR1_RPIF8					(0x1u<<8)
#define	EXTI_RPR1_RPIF7					(0x1u<<7)
#define	EXTI_RPR1_RPIF6					(0x1u<<6)
#define	EXTI_RPR1_RPIF5					(0x1u<<5)
#define	EXTI_RPR1_RPIF4					(0x1u<<4)
#define	EXTI_RPR1_RPIF3					(0x1u<<3)
#define	EXTI_RPR1_RPIF2					(0x1u<<2)
#define	EXTI_RPR1_RPIF1					(0x1u<<1)
#define	EXTI_RPR1_RPIF0					(0x1u<<0)

#define	EXTI_RPR1_RPIF21_B_0X0			(0x0u<<21)
#define	EXTI_RPR1_RPIF21_B_0X1			(0x1u<<21)
#define	EXTI_RPR1_RPIF20_B_0X0			(0x0u<<20)
#define	EXTI_RPR1_RPIF20_B_0X1			(0x1u<<20)

// FPR1 Configuration

#define	EXTI_FPR1_FPIF21				(0x1u<<21)
#define	EXTI_FPR1_FPIF20				(0x1u<<20)
#define	EXTI_FPR1_FPIF15				(0x1u<<15)
#define	EXTI_FPR1_FPIF14				(0x1u<<14)
#define	EXTI_FPR1_FPIF13				(0x1u<<13)
#define	EXTI_FPR1_FPIF12				(0x1u<<12)
#define	EXTI_FPR1_FPIF11				(0x1u<<11)
#define	EXTI_FPR1_FPIF10				(0x1u<<10)
#define	EXTI_FPR1_FPIF9					(0x1u<<9)
#define	EXTI_FPR1_FPIF8					(0x1u<<8)
#define	EXTI_FPR1_FPIF7					(0x1u<<7)
#define	EXTI_FPR1_FPIF6					(0x1u<<6)
#define	EXTI_FPR1_FPIF5					(0x1u<<5)
#define	EXTI_FPR1_FPIF4					(0x1u<<4)
#define	EXTI_FPR1_FPIF3					(0x1u<<3)
#define	EXTI_FPR1_FPIF2					(0x1u<<2)
#define	EXTI_FPR1_FPIF1					(0x1u<<1)
#define	EXTI_FPR1_FPIF0					(0x1u<<0)

#define	EXTI_FPR1_FPIF21_B_0X0			(0x0u<<21)
#define	EXTI_FPR1_FPIF21_B_0X1			(0x1u<<21)
#define	EXTI_FPR1_FPIF20_B_0X0			(0x0u<<20)
#define	EXTI_FPR1_FPIF20_B_0X1			(0x1u<<20)

// SECCFGR1 Configuration

#define	EXTI_SECCFGR1_SEC31				(0x1u<<31)
#define	EXTI_SECCFGR1_SEC30				(0x1u<<30)
#define	EXTI_SECCFGR1_SEC29				(0x1u<<29)
#define	EXTI_SECCFGR1_SEC28				(0x1u<<28)
#define	EXTI_SECCFGR1_SEC27				(0x1u<<27)
#define	EXTI_SECCFGR1_SEC26				(0x1u<<26)
#define	EXTI_SECCFGR1_SEC25				(0x1u<<25)
#define	EXTI_SECCFGR1_SEC24				(0x1u<<24)
#define	EXTI_SECCFGR1_SEC23				(0x1u<<23)
#define	EXTI_SECCFGR1_SEC22				(0x1u<<22)
#define	EXTI_SECCFGR1_SEC21				(0x1u<<21)
#define	EXTI_SECCFGR1_SEC20				(0x1u<<20)
#define	EXTI_SECCFGR1_SEC19				(0x1u<<19)
#define	EXTI_SECCFGR1_SEC18				(0x1u<<18)
#define	EXTI_SECCFGR1_SEC17				(0x1u<<17)
#define	EXTI_SECCFGR1_SEC15				(0x1u<<15)
#define	EXTI_SECCFGR1_SEC14				(0x1u<<14)
#define	EXTI_SECCFGR1_SEC13				(0x1u<<13)
#define	EXTI_SECCFGR1_SEC12				(0x1u<<12)
#define	EXTI_SECCFGR1_SEC11				(0x1u<<11)
#define	EXTI_SECCFGR1_SEC10				(0x1u<<10)
#define	EXTI_SECCFGR1_SEC9				(0x1u<<9)
#define	EXTI_SECCFGR1_SEC8				(0x1u<<8)
#define	EXTI_SECCFGR1_SEC7				(0x1u<<7)
#define	EXTI_SECCFGR1_SEC6				(0x1u<<6)
#define	EXTI_SECCFGR1_SEC5				(0x1u<<5)
#define	EXTI_SECCFGR1_SEC4				(0x1u<<4)
#define	EXTI_SECCFGR1_SEC3				(0x1u<<3)
#define	EXTI_SECCFGR1_SEC2				(0x1u<<2)
#define	EXTI_SECCFGR1_SEC1				(0x1u<<1)
#define	EXTI_SECCFGR1_SEC0				(0x1u<<0)

#define	EXTI_SECCFGR1_SEC31_B_0X0		(0x0u<<31)
#define	EXTI_SECCFGR1_SEC31_B_0X1		(0x1u<<31)
#define	EXTI_SECCFGR1_SEC30_B_0X0		(0x0u<<30)
#define	EXTI_SECCFGR1_SEC30_B_0X1		(0x1u<<30)
#define	EXTI_SECCFGR1_SEC29_B_0X0		(0x0u<<29)
#define	EXTI_SECCFGR1_SEC29_B_0X1		(0x1u<<29)
#define	EXTI_SECCFGR1_SEC28_B_0X0		(0x0u<<28)
#define	EXTI_SECCFGR1_SEC28_B_0X1		(0x1u<<28)
#define	EXTI_SECCFGR1_SEC27_B_0X0		(0x0u<<27)
#define	EXTI_SECCFGR1_SEC27_B_0X1		(0x1u<<27)
#define	EXTI_SECCFGR1_SEC26_B_0X0		(0x0u<<26)
#define	EXTI_SECCFGR1_SEC26_B_0X1		(0x1u<<26)
#define	EXTI_SECCFGR1_SEC25_B_0X0		(0x0u<<25)
#define	EXTI_SECCFGR1_SEC25_B_0X1		(0x1u<<25)
#define	EXTI_SECCFGR1_SEC24_B_0X0		(0x0u<<24)
#define	EXTI_SECCFGR1_SEC24_B_0X1		(0x1u<<24)
#define	EXTI_SECCFGR1_SEC23_B_0X0		(0x0u<<23)
#define	EXTI_SECCFGR1_SEC23_B_0X1		(0x1u<<23)
#define	EXTI_SECCFGR1_SEC22_B_0X0		(0x0u<<22)
#define	EXTI_SECCFGR1_SEC22_B_0X1		(0x1u<<22)
#define	EXTI_SECCFGR1_SEC21_B_0X0		(0x0u<<21)
#define	EXTI_SECCFGR1_SEC21_B_0X1		(0x1u<<21)
#define	EXTI_SECCFGR1_SEC20_B_0X0		(0x0u<<20)
#define	EXTI_SECCFGR1_SEC20_B_0X1		(0x1u<<20)
#define	EXTI_SECCFGR1_SEC19_B_0X0		(0x0u<<19)
#define	EXTI_SECCFGR1_SEC19_B_0X1		(0x1u<<19)
#define	EXTI_SECCFGR1_SEC18_B_0X0		(0x0u<<18)
#define	EXTI_SECCFGR1_SEC18_B_0X1		(0x1u<<18)
#define	EXTI_SECCFGR1_SEC17_B_0X0		(0x0u<<17)
#define	EXTI_SECCFGR1_SEC17_B_0X1		(0x1u<<17)

// PRIVCFGR1 Configuration

#define	EXTI_PRIVCFGR1_PRIV31			(0x1u<<31)
#define	EXTI_PRIVCFGR1_PRIV30			(0x1u<<30)
#define	EXTI_PRIVCFGR1_PRIV29			(0x1u<<29)
#define	EXTI_PRIVCFGR1_PRIV28			(0x1u<<28)
#define	EXTI_PRIVCFGR1_PRIV27			(0x1u<<27)
#define	EXTI_PRIVCFGR1_PRIV26			(0x1u<<26)
#define	EXTI_PRIVCFGR1_PRIV25			(0x1u<<25)
#define	EXTI_PRIVCFGR1_PRIV24			(0x1u<<24)
#define	EXTI_PRIVCFGR1_PRIV23			(0x1u<<23)
#define	EXTI_PRIVCFGR1_PRIV22			(0x1u<<22)
#define	EXTI_PRIVCFGR1_PRIV21			(0x1u<<21)
#define	EXTI_PRIVCFGR1_PRIV20			(0x1u<<20)
#define	EXTI_PRIVCFGR1_PRIV19			(0x1u<<19)
#define	EXTI_PRIVCFGR1_PRIV18			(0x1u<<18)
#define	EXTI_PRIVCFGR1_PRIV17			(0x1u<<17)
#define	EXTI_PRIVCFGR1_PRIV15			(0x1u<<15)
#define	EXTI_PRIVCFGR1_PRIV14			(0x1u<<14)
#define	EXTI_PRIVCFGR1_PRIV13			(0x1u<<13)
#define	EXTI_PRIVCFGR1_PRIV12			(0x1u<<12)
#define	EXTI_PRIVCFGR1_PRIV11			(0x1u<<11)
#define	EXTI_PRIVCFGR1_PRIV10			(0x1u<<10)
#define	EXTI_PRIVCFGR1_PRIV9			(0x1u<<9)
#define	EXTI_PRIVCFGR1_PRIV8			(0x1u<<8)
#define	EXTI_PRIVCFGR1_PRIV7			(0x1u<<7)
#define	EXTI_PRIVCFGR1_PRIV6			(0x1u<<6)
#define	EXTI_PRIVCFGR1_PRIV5			(0x1u<<5)
#define	EXTI_PRIVCFGR1_PRIV4			(0x1u<<4)
#define	EXTI_PRIVCFGR1_PRIV3			(0x1u<<3)
#define	EXTI_PRIVCFGR1_PRIV2			(0x1u<<2)
#define	EXTI_PRIVCFGR1_PRIV1			(0x1u<<1)
#define	EXTI_PRIVCFGR1_PRIV0			(0x1u<<0)

#define	EXTI_PRIVCFGR1_PRIV31_B_0X0		(0x0u<<31)
#define	EXTI_PRIVCFGR1_PRIV31_B_0X1		(0x1u<<31)
#define	EXTI_PRIVCFGR1_PRIV30_B_0X0		(0x0u<<30)
#define	EXTI_PRIVCFGR1_PRIV30_B_0X1		(0x1u<<30)
#define	EXTI_PRIVCFGR1_PRIV29_B_0X0		(0x0u<<29)
#define	EXTI_PRIVCFGR1_PRIV29_B_0X1		(0x1u<<29)
#define	EXTI_PRIVCFGR1_PRIV28_B_0X0		(0x0u<<28)
#define	EXTI_PRIVCFGR1_PRIV28_B_0X1		(0x1u<<28)
#define	EXTI_PRIVCFGR1_PRIV27_B_0X0		(0x0u<<27)
#define	EXTI_PRIVCFGR1_PRIV27_B_0X1		(0x1u<<27)
#define	EXTI_PRIVCFGR1_PRIV26_B_0X0		(0x0u<<26)
#define	EXTI_PRIVCFGR1_PRIV26_B_0X1		(0x1u<<26)
#define	EXTI_PRIVCFGR1_PRIV25_B_0X0		(0x0u<<25)
#define	EXTI_PRIVCFGR1_PRIV25_B_0X1		(0x1u<<25)
#define	EXTI_PRIVCFGR1_PRIV24_B_0X0		(0x0u<<24)
#define	EXTI_PRIVCFGR1_PRIV24_B_0X1		(0x1u<<24)
#define	EXTI_PRIVCFGR1_PRIV23_B_0X0		(0x0u<<23)
#define	EXTI_PRIVCFGR1_PRIV23_B_0X1		(0x1u<<23)
#define	EXTI_PRIVCFGR1_PRIV22_B_0X0		(0x0u<<22)
#define	EXTI_PRIVCFGR1_PRIV22_B_0X1		(0x1u<<22)
#define	EXTI_PRIVCFGR1_PRIV21_B_0X0		(0x0u<<21)
#define	EXTI_PRIVCFGR1_PRIV21_B_0X1		(0x1u<<21)
#define	EXTI_PRIVCFGR1_PRIV20_B_0X0		(0x0u<<20)
#define	EXTI_PRIVCFGR1_PRIV20_B_0X1		(0x1u<<20)
#define	EXTI_PRIVCFGR1_PRIV19_B_0X0		(0x0u<<19)
#define	EXTI_PRIVCFGR1_PRIV19_B_0X1		(0x1u<<19)
#define	EXTI_PRIVCFGR1_PRIV18_B_0X0		(0x0u<<18)
#define	EXTI_PRIVCFGR1_PRIV18_B_0X1		(0x1u<<18)
#define	EXTI_PRIVCFGR1_PRIV17_B_0X0		(0x0u<<17)
#define	EXTI_PRIVCFGR1_PRIV17_B_0X1		(0x1u<<17)

// RTSR2 Configuration

#define	EXTI_RTSR2_RT56					(0x1u<<24)
#define	EXTI_RTSR2_RT54					(0x1u<<22)
#define	EXTI_RTSR2_RT51					(0x1u<<19)
#define	EXTI_RTSR2_RT40					(0x1u<<8)
#define	EXTI_RTSR2_RT39					(0x1u<<7)

