hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_exti.h
#define	EXTI_RTSR2_RT56_B_0X0			(0x0u<<24)
#define	EXTI_RTSR2_RT56_B_0X1			(0x1u<<24)

// FTSR2 Configuration

#define	EXTI_FTSR2_FT56					(0x1u<<24)
#define	EXTI_FTSR2_FT54					(0x1u<<22)
#define	EXTI_FTSR2_FT51					(0x1u<<19)
#define	EXTI_FTSR2_FT40					(0x1u<<8)
#define	EXTI_FTSR2_FT39					(0x1u<<7)

#define	EXTI_FTSR2_FT56_B_0X0			(0x0u<<24)
#define	EXTI_FTSR2_FT56_B_0X1			(0x1u<<24)

// SWIER2 Configuration

#define	EXTI_SWIER2_SWI56				(0x1u<<24)
#define	EXTI_SWIER2_SWI54				(0x1u<<22)
#define	EXTI_SWIER2_SWI51				(0x1u<<19)
#define	EXTI_SWIER2_SWI40				(0x1u<<8)
#define	EXTI_SWIER2_SWI39				(0x1u<<7)

#define	EXTI_SWIER2_SWI56_B_0X0			(0x0u<<24)
#define	EXTI_SWIER2_SWI56_B_0X1			(0x1u<<24)

// RPR2 Configuration

#define	EXTI_RPR2_RPIF56				(0x1u<<24)
#define	EXTI_RPR2_RPIF54				(0x1u<<22)
#define	EXTI_RPR2_RPIF51				(0x1u<<19)
#define	EXTI_RPR2_RPIF40				(0x1u<<8)
#define	EXTI_RPR2_RPIF39				(0x1u<<7)

#define	EXTI_RPR2_RPIF56_B_0X0			(0x0u<<24)
#define	EXTI_RPR2_RPIF56_B_0X1			(0x1u<<24)

// FPR2 Configuration

#define	EXTI_FPR2_FPIF56				(0x1u<<24)
#define	EXTI_FPR2_FPIF54				(0x1u<<22)
#define	EXTI_FPR2_FPIF51				(0x1u<<19)
#define	EXTI_FPR2_FPIF40				(0x1u<<8)
#define	EXTI_FPR2_FPIF39				(0x1u<<7)

#define	EXTI_FPR2_FPIF56_B_0X0			(0x0u<<24)
#define	EXTI_FPR2_FPIF56_B_0X1			(0x1u<<24)

// SECCFGR2 Configuration

#define	EXTI_SECCFGR2_SEC63				(0x1u<<31)
#define	EXTI_SECCFGR2_SEC62				(0x1u<<30)
#define	EXTI_SECCFGR2_SEC61				(0x1u<<29)
#define	EXTI_SECCFGR2_SEC60				(0x1u<<28)
#define	EXTI_SECCFGR2_SEC58				(0x1u<<26)
#define	EXTI_SECCFGR2_SEC57				(0x1u<<25)
#define	EXTI_SECCFGR2_SEC56				(0x1u<<24)
#define	EXTI_SECCFGR2_SEC55				(0x1u<<23)
#define	EXTI_SECCFGR2_SEC54				(0x1u<<22)
#define	EXTI_SECCFGR2_SEC53				(0x1u<<21)
#define	EXTI_SECCFGR2_SEC52				(0x1u<<20)
#define	EXTI_SECCFGR2_SEC51				(0x1u<<19)
#define	EXTI_SECCFGR2_SEC50				(0x1u<<18)
#define	EXTI_SECCFGR2_SEC49				(0x1u<<17)
#define	EXTI_SECCFGR2_SEC48				(0x1u<<16)
#define	EXTI_SECCFGR2_SEC47				(0x1u<<15)
#define	EXTI_SECCFGR2_SEC46				(0x1u<<14)
#define	EXTI_SECCFGR2_SEC45				(0x1u<<13)
#define	EXTI_SECCFGR2_SEC44				(0x1u<<12)
#define	EXTI_SECCFGR2_SEC43				(0x1u<<11)
#define	EXTI_SECCFGR2_SEC42				(0x1u<<10)
#define	EXTI_SECCFGR2_SEC41				(0x1u<<9)
#define	EXTI_SECCFGR2_SEC40				(0x1u<<8)
#define	EXTI_SECCFGR2_SEC39				(0x1u<<7)
#define	EXTI_SECCFGR2_SEC38				(0x1u<<6)
#define	EXTI_SECCFGR2_SEC37				(0x1u<<5)
#define	EXTI_SECCFGR2_SEC36				(0x1u<<4)
#define	EXTI_SECCFGR2_SEC35				(0x1u<<3)
#define	EXTI_SECCFGR2_SEC34				(0x1u<<2)
#define	EXTI_SECCFGR2_SEC33				(0x1u<<1)
#define	EXTI_SECCFGR2_SEC32				(0x1u<<0)

#define	EXTI_SECCFGR2_SEC63_B_0X0		(0x0u<<31)
#define	EXTI_SECCFGR2_SEC63_B_0X1		(0x1u<<31)
#define	EXTI_SECCFGR2_SEC62_B_0X0		(0x0u<<30)
#define	EXTI_SECCFGR2_SEC62_B_0X1		(0x1u<<30)
#define	EXTI_SECCFGR2_SEC61_B_0X0		(0x0u<<29)
#define	EXTI_SECCFGR2_SEC61_B_0X1		(0x1u<<29)
#define	EXTI_SECCFGR2_SEC60_B_0X0		(0x0u<<28)
#define	EXTI_SECCFGR2_SEC60_B_0X1		(0x1u<<28)

// PRIVCFGR2 Configuration

#define	EXTI_PRIVCFGR2_PRIV63			(0x1u<<31)
#define	EXTI_PRIVCFGR2_PRIV62			(0x1u<<30)
#define	EXTI_PRIVCFGR2_PRIV61			(0x1u<<29)
#define	EXTI_PRIVCFGR2_PRIV60			(0x1u<<28)
#define	EXTI_PRIVCFGR2_PRIV58			(0x1u<<26)
#define	EXTI_PRIVCFGR2_PRIV57			(0x1u<<25)
#define	EXTI_PRIVCFGR2_PRIV56			(0x1u<<24)
#define	EXTI_PRIVCFGR2_PRIV55			(0x1u<<23)
#define	EXTI_PRIVCFGR2_PRIV54			(0x1u<<22)
#define	EXTI_PRIVCFGR2_PRIV53			(0x1u<<21)
#define	EXTI_PRIVCFGR2_PRIV52			(0x1u<<20)
#define	EXTI_PRIVCFGR2_PRIV51			(0x1u<<19)
#define	EXTI_PRIVCFGR2_PRIV50			(0x1u<<18)
#define	EXTI_PRIVCFGR2_PRIV49			(0x1u<<17)
#define	EXTI_PRIVCFGR2_PRIV48			(0x1u<<16)
#define	EXTI_PRIVCFGR2_PRIV47			(0x1u<<15)
#define	EXTI_PRIVCFGR2_PRIV46			(0x1u<<14)
#define	EXTI_PRIVCFGR2_PRIV45			(0x1u<<13)
#define	EXTI_PRIVCFGR2_PRIV44			(0x1u<<12)
#define	EXTI_PRIVCFGR2_PRIV43			(0x1u<<11)
#define	EXTI_PRIVCFGR2_PRIV42			(0x1u<<10)
#define	EXTI_PRIVCFGR2_PRIV41			(0x1u<<9)
#define	EXTI_PRIVCFGR2_PRIV40			(0x1u<<8)
#define	EXTI_PRIVCFGR2_PRIV39			(0x1u<<7)
#define	EXTI_PRIVCFGR2_PRIV38			(0x1u<<6)
#define	EXTI_PRIVCFGR2_PRIV37			(0x1u<<5)
#define	EXTI_PRIVCFGR2_PRIV36			(0x1u<<4)
#define	EXTI_PRIVCFGR2_PRIV35			(0x1u<<3)
#define	EXTI_PRIVCFGR2_PRIV34			(0x1u<<2)
#define	EXTI_PRIVCFGR2_PRIV33			(0x1u<<1)
#define	EXTI_PRIVCFGR2_PRIV32			(0x1u<<0)

#define	EXTI_PRIVCFGR2_PRIV63_B_0X0		(0x0u<<31)
#define	EXTI_PRIVCFGR2_PRIV63_B_0X1		(0x1u<<31)
#define	EXTI_PRIVCFGR2_PRIV62_B_0X0		(0x0u<<30)
#define	EXTI_PRIVCFGR2_PRIV62_B_0X1		(0x1u<<30)
#define	EXTI_PRIVCFGR2_PRIV61_B_0X0		(0x0u<<29)
#define	EXTI_PRIVCFGR2_PRIV61_B_0X1		(0x1u<<29)
#define	EXTI_PRIVCFGR2_PRIV60_B_0X0		(0x0u<<28)
#define	EXTI_PRIVCFGR2_PRIV60_B_0X1		(0x1u<<28)

// RTSR3 Configuration

#define	EXTI_RTSR3_RT74					(0x1u<<10)
#define	EXTI_RTSR3_RT73					(0x1u<<9)
#define	EXTI_RTSR3_RT72					(0x1u<<8)
#define	EXTI_RTSR3_RT71					(0x1u<<7)
#define	EXTI_RTSR3_RT70					(0x1u<<6)
#define	EXTI_RTSR3_RT69					(0x1u<<5)
#define	EXTI_RTSR3_RT68					(0x1u<<4)
#define	EXTI_RTSR3_RT66					(0x1u<<2)

#define	EXTI_RTSR3_RT74_B_0X0			(0x0u<<10)
#define	EXTI_RTSR3_RT74_B_0X1			(0x1u<<10)
#define	EXTI_RTSR3_RT73_B_0X0			(0x0u<<9)
#define	EXTI_RTSR3_RT73_B_0X1			(0x1u<<9)
#define	EXTI_RTSR3_RT72_B_0X0			(0x0u<<8)
#define	EXTI_RTSR3_RT72_B_0X1			(0x1u<<8)
#define	EXTI_RTSR3_RT71_B_0X0			(0x0u<<7)
#define	EXTI_RTSR3_RT71_B_0X1			(0x1u<<7)
#define	EXTI_RTSR3_RT70_B_0X0			(0x0u<<6)
#define	EXTI_RTSR3_RT70_B_0X1			(0x1u<<6)
#define	EXTI_RTSR3_RT69_B_0X0			(0x0u<<5)
#define	EXTI_RTSR3_RT69_B_0X1			(0x1u<<5)
#define	EXTI_RTSR3_RT68_B_0X0			(0x0u<<4)
#define	EXTI_RTSR3_RT68_B_0X1			(0x1u<<4)

// FTSR3 Configuration

#define	EXTI_FTSR3_FT74					(0x1u<<10)
#define	EXTI_FTSR3_FT73					(0x1u<<9)
#define	EXTI_FTSR3_FT72					(0x1u<<8)
#define	EXTI_FTSR3_FT71					(0x1u<<7)
#define	EXTI_FTSR3_FT70					(0x1u<<6)
#define	EXTI_FTSR3_FT69					(0x1u<<5)
#define	EXTI_FTSR3_FT68					(0x1u<<4)
#define	EXTI_FTSR3_FT66					(0x1u<<2)

#define	EXTI_FTSR3_FT74_B_0X0			(0x0u<<10)
#define	EXTI_FTSR3_FT74_B_0X1			(0x1u<<10)
#define	EXTI_FTSR3_FT73_B_0X0			(0x0u<<9)
#define	EXTI_FTSR3_FT73_B_0X1			(0x1u<<9)
#define	EXTI_FTSR3_FT72_B_0X0			(0x0u<<8)
#define	EXTI_FTSR3_FT72_B_0X1			(0x1u<<8)
#define	EXTI_FTSR3_FT71_B_0X0			(0x0u<<7)
#define	EXTI_FTSR3_FT71_B_0X1			(0x1u<<7)
#define	EXTI_FTSR3_FT70_B_0X0			(0x0u<<6)
#define	EXTI_FTSR3_FT70_B_0X1			(0x1u<<6)
#define	EXTI_FTSR3_FT69_B_0X0			(0x0u<<5)
#define	EXTI_FTSR3_FT69_B_0X1			(0x1u<<5)
#define	EXTI_FTSR3_FT68_B_0X0			(0x0u<<4)
#define	EXTI_FTSR3_FT68_B_0X1			(0x1u<<4)

// SWIER3 Configuration

#define	EXTI_SWIER3_SWI74				(0x1u<<10)
#define	EXTI_SWIER3_SWI73				(0x1u<<9)
#define	EXTI_SWIER3_SWI72				(0x1u<<8)
#define	EXTI_SWIER3_SWI71				(0x1u<<7)
#define	EXTI_SWIER3_SWI70				(0x1u<<6)
#define	EXTI_SWIER3_SWI69				(0x1u<<5)
#define	EXTI_SWIER3_SWI68				(0x1u<<4)
#define	EXTI_SWIER3_SWI66				(0x1u<<2)

#define	EXTI_SWIER3_SWI74_B_0X0			(0x0u<<10)
#define	EXTI_SWIER3_SWI74_B_0X1			(0x1u<<10)
#define	EXTI_SWIER3_SWI73_B_0X0			(0x0u<<9)
#define	EXTI_SWIER3_SWI73_B_0X1			(0x1u<<9)
#define	EXTI_SWIER3_SWI72_B_0X0			(0x0u<<8)
#define	EXTI_SWIER3_SWI72_B_0X1			(0x1u<<8)
#define	EXTI_SWIER3_SWI71_B_0X0			(0x0u<<7)
#define	EXTI_SWIER3_SWI71_B_0X1			(0x1u<<7)
#define	EXTI_SWIER3_SWI70_B_0X0			(0x0u<<6)
#define	EXTI_SWIER3_SWI70_B_0X1			(0x1u<<6)
#define	EXTI_SWIER3_SWI69_B_0X0			(0x0u<<5)
#define	EXTI_SWIER3_SWI69_B_0X1			(0x1u<<5)
#define	EXTI_SWIER3_SWI68_B_0X0			(0x0u<<4)
#define	EXTI_SWIER3_SWI68_B_0X1			(0x1u<<4)

// RPR3 Configuration

#define	EXTI_RPR3_RPIF74				(0x1u<<10)
#define	EXTI_RPR3_RPIF73				(0x1u<<9)
#define	EXTI_RPR3_RPIF72				(0x1u<<8)
#define	EXTI_RPR3_RPIF71				(0x1u<<7)
#define	EXTI_RPR3_RPIF70				(0x1u<<6)
#define	EXTI_RPR3_RPIF69				(0x1u<<5)
#define	EXTI_RPR3_RPIF68				(0x1u<<4)
#define	EXTI_RPR3_RPIF66				(0x1u<<2)

#define	EXTI_RPR3_RPIF74_B_0X0			(0x0u<<10)
#define	EXTI_RPR3_RPIF74_B_0X1			(0x1u<<10)
#define	EXTI_RPR3_RPIF73_B_0X0			(0x0u<<9)
#define	EXTI_RPR3_RPIF73_B_0X1			(0x1u<<9)
#define	EXTI_RPR3_RPIF72_B_0X0			(0x0u<<8)
#define	EXTI_RPR3_RPIF72_B_0X1			(0x1u<<8)
#define	EXTI_RPR3_RPIF71_B_0X0			(0x0u<<7)
#define	EXTI_RPR3_RPIF71_B_0X1			(0x1u<<7)
#define	EXTI_RPR3_RPIF70_B_0X0			(0x0u<<6)
#define	EXTI_RPR3_RPIF70_B_0X1			(0x1u<<6)
#define	EXTI_RPR3_RPIF69_B_0X0			(0x0u<<5)
#define	EXTI_RPR3_RPIF69_B_0X1			(0x1u<<5)
#define	EXTI_RPR3_RPIF68_B_0X0			(0x0u<<4)
#define	EXTI_RPR3_RPIF68_B_0X1			(0x1u<<4)

