hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_exti.h
// FPR3 Configuration

#define	EXTI_FPR3_FPIF74				(0x1u<<10)
#define	EXTI_FPR3_FPIF73				(0x1u<<9)
#define	EXTI_FPR3_FPIF72				(0x1u<<8)
#define	EXTI_FPR3_FPIF71				(0x1u<<7)
#define	EXTI_FPR3_FPIF70				(0x1u<<6)
#define	EXTI_FPR3_FPIF69				(0x1u<<5)
#define	EXTI_FPR3_FPIF68				(0x1u<<4)
#define	EXTI_FPR3_FPIF66				(0x1u<<2)

#define	EXTI_FPR3_FPIF74_B_0X0			(0x0u<<10)
#define	EXTI_FPR3_FPIF74_B_0X1			(0x1u<<10)
#define	EXTI_FPR3_FPIF73_B_0X0			(0x0u<<9)
#define	EXTI_FPR3_FPIF73_B_0X1			(0x1u<<9)
#define	EXTI_FPR3_FPIF72_B_0X0			(0x0u<<8)
#define	EXTI_FPR3_FPIF72_B_0X1			(0x1u<<8)
#define	EXTI_FPR3_FPIF71_B_0X0			(0x0u<<7)
#define	EXTI_FPR3_FPIF71_B_0X1			(0x1u<<7)
#define	EXTI_FPR3_FPIF70_B_0X0			(0x0u<<6)
#define	EXTI_FPR3_FPIF70_B_0X1			(0x1u<<6)
#define	EXTI_FPR3_FPIF69_B_0X0			(0x0u<<5)
#define	EXTI_FPR3_FPIF69_B_0X1			(0x1u<<5)
#define	EXTI_FPR3_FPIF68_B_0X0			(0x0u<<4)
#define	EXTI_FPR3_FPIF68_B_0X1			(0x1u<<4)

// SECCFGR3 Configuration

#define	EXTI_SECCFGR3_SEC77				(0x1u<<13)
#define	EXTI_SECCFGR3_SEC74				(0x1u<<10)
#define	EXTI_SECCFGR3_SEC73				(0x1u<<9)
#define	EXTI_SECCFGR3_SEC72				(0x1u<<8)
#define	EXTI_SECCFGR3_SEC71				(0x1u<<7)
#define	EXTI_SECCFGR3_SEC70				(0x1u<<6)
#define	EXTI_SECCFGR3_SEC69				(0x1u<<5)
#define	EXTI_SECCFGR3_SEC68				(0x1u<<4)
#define	EXTI_SECCFGR3_SEC66				(0x1u<<2)
#define	EXTI_SECCFGR3_SEC65				(0x1u<<1)
#define	EXTI_SECCFGR3_SEC64				(0x1u<<0)

#define	EXTI_SECCFGR3_SEC77_B_0X0		(0x0u<<13)
#define	EXTI_SECCFGR3_SEC77_B_0X1		(0x1u<<13)

// PRIVCFGR3 Configuration

#define	EXTI_PRIVCFGR3_PRIV77			(0x1u<<13)
#define	EXTI_PRIVCFGR3_PRIV74			(0x1u<<10)
#define	EXTI_PRIVCFGR3_PRIV73			(0x1u<<9)
#define	EXTI_PRIVCFGR3_PRIV72			(0x1u<<8)
#define	EXTI_PRIVCFGR3_PRIV71			(0x1u<<7)
#define	EXTI_PRIVCFGR3_PRIV70			(0x1u<<6)
#define	EXTI_PRIVCFGR3_PRIV69			(0x1u<<5)
#define	EXTI_PRIVCFGR3_PRIV68			(0x1u<<4)
#define	EXTI_PRIVCFGR3_PRIV66			(0x1u<<2)
#define	EXTI_PRIVCFGR3_PRIV65			(0x1u<<1)
#define	EXTI_PRIVCFGR3_PRIV64			(0x1u<<0)

#define	EXTI_PRIVCFGR3_PRIV77_B_0X0		(0x0u<<13)
#define	EXTI_PRIVCFGR3_PRIV77_B_0X1		(0x1u<<13)

// EXTICR1 Configuration

#define	EXTI_EXTICR1_EXTI3				(0xFFu<<24)
#define	EXTI_EXTICR1_EXTI3_0			(0x1u<<24)
#define	EXTI_EXTICR1_EXTI2				(0xFFu<<16)
#define	EXTI_EXTICR1_EXTI2_0			(0x1u<<16)
#define	EXTI_EXTICR1_EXTI1				(0xFFu<<8)
#define	EXTI_EXTICR1_EXTI1_0			(0x1u<<8)
#define	EXTI_EXTICR1_EXTI0				(0xFFu<<0)
#define	EXTI_EXTICR1_EXTI0_0			(0x1u<<0)

#define	EXTI_EXTICR1_EXTI3_B_0X00		(0x0u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X01		(0x1u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X02		(0x2u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X03		(0x3u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X04		(0x4u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X05		(0x5u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X06		(0x6u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X07		(0x7u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X08		(0x8u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X09		(0x9u<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X0A		(0xAu<<24)
#define	EXTI_EXTICR1_EXTI3_B_0X0B		(0xBu<<24)
#define	EXTI_EXTICR1_EXTI2_B_0X00		(0x0u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X01		(0x1u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X02		(0x2u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X03		(0x3u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X04		(0x4u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X05		(0x5u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X06		(0x6u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X07		(0x7u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X08		(0x8u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X09		(0x9u<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X0A		(0xAu<<16)
#define	EXTI_EXTICR1_EXTI2_B_0X0B		(0xBu<<16)
#define	EXTI_EXTICR1_EXTI1_B_0X00		(0x0u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X01		(0x1u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X02		(0x2u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X03		(0x3u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X04		(0x4u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X05		(0x5u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X06		(0x6u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X07		(0x7u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X08		(0x8u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X09		(0x9u<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X0A		(0xAu<<8)
#define	EXTI_EXTICR1_EXTI1_B_0X0B		(0xBu<<8)
#define	EXTI_EXTICR1_EXTI0_B_0X00		(0x0u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X01		(0x1u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X02		(0x2u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X03		(0x3u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X04		(0x4u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X05		(0x5u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X06		(0x6u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X07		(0x7u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X08		(0x8u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X09		(0x9u<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X0A		(0xAu<<0)
#define	EXTI_EXTICR1_EXTI0_B_0X0B		(0xBu<<0)

// EXTICR2 Configuration

#define	EXTI_EXTICR2_EXTI7				(0xFFu<<24)
#define	EXTI_EXTICR2_EXTI7_0			(0x1u<<24)
#define	EXTI_EXTICR2_EXTI6				(0xFFu<<16)
#define	EXTI_EXTICR2_EXTI6_0			(0x1u<<16)
#define	EXTI_EXTICR2_EXTI5				(0xFFu<<8)
#define	EXTI_EXTICR2_EXTI5_0			(0x1u<<8)
#define	EXTI_EXTICR2_EXTI4				(0xFFu<<0)
#define	EXTI_EXTICR2_EXTI4_0			(0x1u<<0)

#define	EXTI_EXTICR2_EXTI7_B_0X00		(0x0u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X01		(0x1u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X02		(0x2u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X03		(0x3u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X04		(0x4u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X05		(0x5u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X06		(0x6u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X07		(0x7u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X08		(0x8u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X09		(0x9u<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X0A		(0xAu<<24)
#define	EXTI_EXTICR2_EXTI7_B_0X0B		(0xBu<<24)
#define	EXTI_EXTICR2_EXTI6_B_0X00		(0x0u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X01		(0x1u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X02		(0x2u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X03		(0x3u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X04		(0x4u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X05		(0x5u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X06		(0x6u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X07		(0x7u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X08		(0x8u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X09		(0x9u<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X0A		(0xAu<<16)
#define	EXTI_EXTICR2_EXTI6_B_0X0B		(0xBu<<16)
#define	EXTI_EXTICR2_EXTI5_B_0X00		(0x0u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X01		(0x1u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X02		(0x2u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X03		(0x3u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X04		(0x4u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X05		(0x5u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X06		(0x6u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X07		(0x7u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X08		(0x8u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X09		(0x9u<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X0A		(0xAu<<8)
#define	EXTI_EXTICR2_EXTI5_B_0X0B		(0xBu<<8)
#define	EXTI_EXTICR2_EXTI4_B_0X00		(0x0u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X01		(0x1u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X02		(0x2u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X03		(0x3u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X04		(0x4u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X05		(0x5u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X06		(0x6u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X07		(0x7u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X08		(0x8u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X09		(0x9u<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X0A		(0xAu<<0)
#define	EXTI_EXTICR2_EXTI4_B_0X0B		(0xBu<<0)

// EXTICR3 Configuration

#define	EXTI_EXTICR3_EXTI11				(0xFFu<<24)
#define	EXTI_EXTICR3_EXTI11_0			(0x1u<<24)
#define	EXTI_EXTICR3_EXTI10				(0xFFu<<16)
#define	EXTI_EXTICR3_EXTI10_0			(0x1u<<16)
#define	EXTI_EXTICR3_EXTI9				(0xFFu<<8)
#define	EXTI_EXTICR3_EXTI9_0			(0x1u<<8)
#define	EXTI_EXTICR3_EXTI8				(0xFFu<<0)
#define	EXTI_EXTICR3_EXTI8_0			(0x1u<<0)

#define	EXTI_EXTICR3_EXTI11_B_0X00		(0x0u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X01		(0x1u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X02		(0x2u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X03		(0x3u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X04		(0x4u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X05		(0x5u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X06		(0x6u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X07		(0x7u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X08		(0x8u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X09		(0x9u<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X0A		(0xAu<<24)
#define	EXTI_EXTICR3_EXTI11_B_0X0B		(0xBu<<24)
#define	EXTI_EXTICR3_EXTI10_B_0X00		(0x0u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X01		(0x1u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X02		(0x2u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X03		(0x3u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X04		(0x4u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X05		(0x5u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X06		(0x6u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X07		(0x7u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X08		(0x8u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X09		(0x9u<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X0A		(0xAu<<16)
#define	EXTI_EXTICR3_EXTI10_B_0X0B		(0xBu<<16)
#define	EXTI_EXTICR3_EXTI9_B_0X00		(0x0u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X01		(0x1u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X02		(0x2u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X03		(0x3u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X04		(0x4u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X05		(0x5u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X06		(0x6u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X07		(0x7u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X08		(0x8u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X09		(0x9u<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X0A		(0xAu<<8)
#define	EXTI_EXTICR3_EXTI9_B_0X0B		(0xBu<<8)
#define	EXTI_EXTICR3_EXTI8_B_0X00		(0x0u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X01		(0x1u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X02		(0x2u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X03		(0x3u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X04		(0x4u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X05		(0x5u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X06		(0x6u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X07		(0x7u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X08		(0x8u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X09		(0x9u<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X0A		(0xAu<<0)
#define	EXTI_EXTICR3_EXTI8_B_0X0B		(0xBu<<0)

// EXTICR4 Configuration

