hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_exti.h
#define	EXTI_IMR2_IM63					(0x1u<<31)
#define	EXTI_IMR2_IM62					(0x1u<<30)
#define	EXTI_IMR2_IM61					(0x1u<<29)
#define	EXTI_IMR2_IM60					(0x1u<<28)
#define	EXTI_IMR2_IM58					(0x1u<<26)
#define	EXTI_IMR2_IM57					(0x1u<<25)
#define	EXTI_IMR2_IM56					(0x1u<<24)
#define	EXTI_IMR2_IM55					(0x1u<<23)
#define	EXTI_IMR2_IM54					(0x1u<<22)
#define	EXTI_IMR2_IM53					(0x1u<<21)
#define	EXTI_IMR2_IM52					(0x1u<<20)
#define	EXTI_IMR2_IM51					(0x1u<<19)
#define	EXTI_IMR2_IM50					(0x1u<<18)
#define	EXTI_IMR2_IM49					(0x1u<<17)
#define	EXTI_IMR2_IM48					(0x1u<<16)
#define	EXTI_IMR2_IM47					(0x1u<<15)
#define	EXTI_IMR2_IM46					(0x1u<<14)
#define	EXTI_IMR2_IM45					(0x1u<<13)
#define	EXTI_IMR2_IM44					(0x1u<<12)
#define	EXTI_IMR2_IM43					(0x1u<<11)
#define	EXTI_IMR2_IM42					(0x1u<<10)
#define	EXTI_IMR2_IM41					(0x1u<<9)
#define	EXTI_IMR2_IM40					(0x1u<<8)
#define	EXTI_IMR2_IM39					(0x1u<<7)
#define	EXTI_IMR2_IM38					(0x1u<<6)
#define	EXTI_IMR2_IM37					(0x1u<<5)
#define	EXTI_IMR2_IM36					(0x1u<<4)
#define	EXTI_IMR2_IM35					(0x1u<<3)
#define	EXTI_IMR2_IM34					(0x1u<<2)
#define	EXTI_IMR2_IM33					(0x1u<<1)
#define	EXTI_IMR2_IM32					(0x1u<<0)

#define	EXTI_IMR2_IM63_B_0X0			(0x0u<<31)
#define	EXTI_IMR2_IM63_B_0X1			(0x1u<<31)
#define	EXTI_IMR2_IM62_B_0X0			(0x0u<<30)
#define	EXTI_IMR2_IM62_B_0X1			(0x1u<<30)
#define	EXTI_IMR2_IM61_B_0X0			(0x0u<<29)
#define	EXTI_IMR2_IM61_B_0X1			(0x1u<<29)
#define	EXTI_IMR2_IM60_B_0X0			(0x0u<<28)
#define	EXTI_IMR2_IM60_B_0X1			(0x1u<<28)

// EMR2 Configuration

#define	EXTI_EMR2_EM63					(0x1u<<31)
#define	EXTI_EMR2_EM62					(0x1u<<30)
#define	EXTI_EMR2_EM61					(0x1u<<29)
#define	EXTI_EMR2_EM60					(0x1u<<28)
#define	EXTI_EMR2_EM58					(0x1u<<26)
#define	EXTI_EMR2_EM57					(0x1u<<25)
#define	EXTI_EMR2_EM56					(0x1u<<24)
#define	EXTI_EMR2_EM55					(0x1u<<23)
#define	EXTI_EMR2_EM54					(0x1u<<22)
#define	EXTI_EMR2_EM53					(0x1u<<21)
#define	EXTI_EMR2_EM52					(0x1u<<20)
#define	EXTI_EMR2_EM51					(0x1u<<19)
#define	EXTI_EMR2_EM50					(0x1u<<18)
#define	EXTI_EMR2_EM49					(0x1u<<17)
#define	EXTI_EMR2_EM48					(0x1u<<16)
#define	EXTI_EMR2_EM47					(0x1u<<15)
#define	EXTI_EMR2_EM46					(0x1u<<14)
#define	EXTI_EMR2_EM45					(0x1u<<13)
#define	EXTI_EMR2_EM44					(0x1u<<12)
#define	EXTI_EMR2_EM43					(0x1u<<11)
#define	EXTI_EMR2_EM42					(0x1u<<10)
#define	EXTI_EMR2_EM41					(0x1u<<9)
#define	EXTI_EMR2_EM40					(0x1u<<8)
#define	EXTI_EMR2_EM39					(0x1u<<7)
#define	EXTI_EMR2_EM38					(0x1u<<6)
#define	EXTI_EMR2_EM37					(0x1u<<5)
#define	EXTI_EMR2_EM36					(0x1u<<4)
#define	EXTI_EMR2_EM35					(0x1u<<3)
#define	EXTI_EMR2_EM34					(0x1u<<2)
#define	EXTI_EMR2_EM33					(0x1u<<1)
#define	EXTI_EMR2_EM32					(0x1u<<0)

#define	EXTI_EMR2_EM63_B_0X0			(0x0u<<31)
#define	EXTI_EMR2_EM63_B_0X1			(0x1u<<31)
#define	EXTI_EMR2_EM62_B_0X0			(0x0u<<30)
#define	EXTI_EMR2_EM62_B_0X1			(0x1u<<30)
#define	EXTI_EMR2_EM61_B_0X0			(0x0u<<29)
#define	EXTI_EMR2_EM61_B_0X1			(0x1u<<29)
#define	EXTI_EMR2_EM60_B_0X0			(0x0u<<28)
#define	EXTI_EMR2_EM60_B_0X1			(0x1u<<28)

// IMR3 Configuration

#define	EXTI_IMR3_IM77					(0x1u<<13)
#define	EXTI_IMR3_IM74					(0x1u<<10)
#define	EXTI_IMR3_IM73					(0x1u<<9)
#define	EXTI_IMR3_IM72					(0x1u<<8)
#define	EXTI_IMR3_IM71					(0x1u<<7)
#define	EXTI_IMR3_IM70					(0x1u<<6)
#define	EXTI_IMR3_IM69					(0x1u<<5)
#define	EXTI_IMR3_IM68					(0x1u<<4)
#define	EXTI_IMR3_IM66					(0x1u<<2)
#define	EXTI_IMR3_IM65					(0x1u<<1)
#define	EXTI_IMR3_IM64					(0x1u<<0)

#define	EXTI_IMR3_IM77_B_0X0			(0x0u<<13)
#define	EXTI_IMR3_IM77_B_0X1			(0x1u<<13)

// EMR3 Configuration

#define	EXTI_EMR3_EM77					(0x1u<<13)
#define	EXTI_EMR3_EM74					(0x1u<<10)
#define	EXTI_EMR3_EM73					(0x1u<<9)
#define	EXTI_EMR3_EM72					(0x1u<<8)
#define	EXTI_EMR3_EM71					(0x1u<<7)
#define	EXTI_EMR3_EM70					(0x1u<<6)
#define	EXTI_EMR3_EM69					(0x1u<<5)
#define	EXTI_EMR3_EM68					(0x1u<<4)
#define	EXTI_EMR3_EM66					(0x1u<<2)
#define	EXTI_EMR3_EM65					(0x1u<<1)
#define	EXTI_EMR3_EM64					(0x1u<<0)

#define	EXTI_EMR3_EM77_B_0X0			(0x0u<<13)
#define	EXTI_EMR3_EM77_B_0X1			(0x1u<<13)
